sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
/****************************************************************************
 * modules/bluetooth/hal/nrf52/ble_comm.c
 *
 *   Copyright 2022 Sony Semiconductor Solutions Corporation
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name of Sony Semiconductor Solutions Corporation nor
 *    the names of its contributors may be used to endorse or promote
 *    products derived from this software without specific prior written
 *    permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <string.h>
#include <unistd.h>
#include <ble/ble_comm.h>
#include <ble/ble_gap.h>
#include <ble/ble_gatts.h>
#include <ble/ble_gattc.h>
#include "ble_storage_operations.h"
#include "ble_comm_internal.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include <arch/board/board.h>
#include <system/readline.h>

/******************************************************************************
 * externs
 *****************************************************************************/
extern bleGapMem *bleGetGapMem(void);
extern void bleMngEvtDispatch(ble_evt_t *nrfEvt);
extern void board_nrf52_initialize(void);
extern void board_nrf52_reset(bool en);

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/
// #define BLE_DBGPRT_ENABLE
#ifdef BLE_DBGPRT_ENABLE
#include <stdio.h>
#define BLE_PRT printf
#define BLE_PRT2(...)
#define BLE_ERR printf
#else
#define BLE_PRT(...)
#define BLE_PRT2(...)
#define BLE_ERR(...)
#endif

 /******************************************************************************
 * Structure define
 *****************************************************************************/

 /******************************************************************************
 * Function prototype declaration
 *****************************************************************************/
static int blePowerOn(void);
static int bleStackInit(void);
static int bleStackFin(void);
#ifdef BLE_USE_SECTION
static void bleEvtDispatch(ble_evt_t *pBleNrfEvt);
#endif
#if NRF_SD_BLE_API_VERSION > 5
static void onAdvSetTerminate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
#endif
static void onScanReqReport(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onPhyUpdateReq(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onPhyUpdate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onDataLengthUpdateRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onDataLengthUpdate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onExchangeMtuRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onTxComplete(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onConnect(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onConnParamUpdate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onConnParamUpdateRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onDisconnect(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onSecParamsRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onAuthStatus(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onDispPasskey(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onAdvReport(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onAuthKeyRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onConnSecUpdate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onSecInfoRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onTimeout(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onGattsTimeout(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onRssiChanged(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onGattsWrite(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onGattsIndConfirm(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onPrimarySrvDiscoveryRsp(bleGattcDb *gattcDbDiscovery, BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onCharacteristicDiscoveryRsp(bleGattcDb *const gattcDbDiscovery, BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onDescriptorDiscoveryRsp(bleGattcDb *const gattcDbDiscovery, BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onHvx(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onSysAttrMissing(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onReadRsp(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onWriteRsp(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt);
static void onSrvDiscCompletion(BLE_Evt *pBleEvent, bleGattcDb *gattcDbDiscovery);
static  int characteristicsDiscover(BLE_Evt *pBleEvent, bleGattcDb *const gattcDbDiscovery);
static bool isCharDiscoveryReqd(bleGattcDb *const gattcDbDiscovery, BLE_GattcChar *afterChar);
static bool isDescDiscoveryReqd(bleGattcDb *gattcDbDiscovery, BLE_GattcDbDiscChar *currChar, BLE_GattcDbDiscChar *nextChar, BLE_GattcHandleRange *handleRange);
static  int descriptorsDiscover(BLE_Evt *pBleEvent, bleGattcDb *const gattcDbDiscovery, bool *raiseDiscovComplete);

static int nrf52_ble_scan(bool enable);
static int nrf52_ble_connect(const BT_ADDR *addr);
static int nrf52_ble_disconnect(const uint16_t conn_handle);
static int nrf52_ble_advertise(bool enable);
static int nrf52_ble_set_dev_addr(BT_ADDR *addr);
static int nrf52_ble_set_dev_name(char *name);
static int nrf52_ble_set_appearance(BLE_APPEARANCE appearance);
static int nrf52_ble_set_ppcp(BLE_CONN_PARAMS ppcp);

static int nrf52_bt_init(void);
static int nrf52_bt_finalize(void);
static int nrf52_bt_enable(bool enable);

