sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
/******************************************************************************
 * Private Data
 *****************************************************************************/
bleCommMem commMem = {0};
bleGapWrapperBondInfo BondInfoInFlash[BLE_SAVE_BOND_DEVICE_MAX_NUM] = {{0}};
uint32_t bleBondEnableList = 0;
bleBondInfoKey bleKey = {0};
struct bt_common_context_s bt_common_context = {0};

#define BUF_LEN_MAX 32

#ifndef CONFIG_NRF51822
#define READ_BUFF_LEN 512
#else
#define READ_BUFF_LEN 20
#endif

#define WAIT_TIME (100*1000)
#define LOG_OUT printf
#define AUTH_KEY_SIZE   6
static BLE_GattcDbDiscovery gattc_db_discovery = {0};

static struct ble_hal_common_ops_s ble_hal_common_ops =
{
  .setDevAddr    = nrf52_ble_set_dev_addr,
  .setDevName    = nrf52_ble_set_dev_name,
  .setAppearance = nrf52_ble_set_appearance,
  .setPPCP       = nrf52_ble_set_ppcp,
  .advertise     = nrf52_ble_advertise,
  .scan          = nrf52_ble_scan,
  .connect       = nrf52_ble_connect,
  .disconnect    = nrf52_ble_disconnect
};

static struct bt_hal_common_ops_s bt_hal_common_ops =
{
  .init          = nrf52_bt_init,
  .finalize      = nrf52_bt_finalize,
  .enable        = nrf52_bt_enable,
  .setDevAddr    = NULL,
  .getDevAddr    = NULL,
  .setDevName    = NULL,
  .getDevName    = NULL,
  .paringEnable  = NULL,
  .getBondList   = NULL,
  .unBond        = NULL,
  .setVisibility = NULL,
  .inquiryStart  = NULL,
  .inquiryCancel = NULL
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static int blePowerOff(void)
{
  int ret = 0;

//  for support reset pin. (Will be valid later)
//  board_nrf52_reset(true);
  ret = board_power_control(POWER_BTBLE, false);
  if (ret)
    {
      BLE_PRT("board_power_control(off): NG %d\n", ret);
      return ret;
    }
  BLE_PRT("Power off BLE!!\n");
  return BLE_SUCCESS;
}

static void bleInitBondInfoKey(void)
{
  bleKey.enable_key = BSO_GenerateRegistryKey(BOND_ENABLE_KEY_NAME, 0);
  bleKey.info_key[0] = BSO_GenerateRegistryKey(BOND_INFO_1_KEY_NAME, 0);
  bleKey.info_key[1] = BSO_GenerateRegistryKey(BOND_INFO_2_KEY_NAME, 0);
  bleKey.info_key[2] = BSO_GenerateRegistryKey(BOND_INFO_3_KEY_NAME, 0);
  bleKey.info_key[3] = BSO_GenerateRegistryKey(BOND_INFO_4_KEY_NAME, 0);
  bleKey.info_key[4] = BSO_GenerateRegistryKey(BOND_INFO_5_KEY_NAME, 0);
  bleKey.info_key[5] = BSO_GenerateRegistryKey(BOND_INFO_6_KEY_NAME, 0);
  bleKey.info_key[6] = BSO_GenerateRegistryKey(BOND_INFO_7_KEY_NAME, 0);
  bleKey.info_key[7] = BSO_GenerateRegistryKey(BOND_INFO_8_KEY_NAME, 0);
#ifdef BLE_DBGPRT_ENABLE
  BLE_PRT("bleInitBondInfoKey: enable_key 0x%lx\n", bleKey.enable_key);
  for (int i=0; i<BLE_SAVE_BOND_DEVICE_MAX_NUM; i++) {
    BLE_PRT("bleInitBondInfoKey: info_key[%d] 0x%lx\n", i, bleKey.info_key[i]);
  }
#endif
}

static int bleGetBondInfo(void)
{
  int ret = 0;
  bleInitBondInfoKey();
  ret = BSO_GetRegistryValue(bleKey.enable_key, (void *)&bleBondEnableList, sizeof(uint32_t));
  if (ret == -ENOENT)
    {
      BLE_PRT("bleGetBondInfo: Set bleBondEnableList = 0\n");
      bleBondEnableList = 0;
      BSO_SetRegistryValue(bleKey.enable_key, (const void*)&bleBondEnableList, sizeof(uint32_t));
      BSO_Sync();
    }
  else if (0 != ret)
    {
      BLE_PRT("bleGetBondInfo: Get bleBondEnableList NG %d\n", ret);
      return ret;
    }
  
  BLE_PRT("bleGetBondInfo: bleBondEnableList 0x%lx\n", bleBondEnableList);
  for (int i=0; i<BLE_SAVE_BOND_DEVICE_MAX_NUM; i++)
    {
      ret = BSO_GetRegistryValue(bleKey.info_key[i], (void *)&BondInfoInFlash[i], sizeof(bleGapWrapperBondInfo));
      if(ret == -ENOENT)
        {
          BLE_PRT("bleGetBondInfo: Set bleBondEnableList = 0\n");
          bleBondEnableList = 0;
          BSO_SetRegistryValue(bleKey.info_key[i], (const void*)&BondInfoInFlash[i], sizeof(bleGapWrapperBondInfo));
          BSO_Sync();
        }
      else if (0 != ret)
        {
          BLE_PRT("bleGetBondInfo: Get BondInfoInFlash[%d] NG %d\n", i, ret);
          return ret;
        }
    }
  return 0;
}

int BLE_CommonInitializeStack(BLE_InitializeParams *initializeParams)
{
  uint8_t role = 0;
  int ret = BLE_SUCCESS;

  if (initializeParams == NULL)
    {
      return -EINVAL;
    }
  if (commMem.stackInited)
    {
      return -EPERM;
    }

//  for pin configuration. (Will be valid later)
//  board_nrf52_initialize();

  commMem.gapMem = bleGetGapMem();
  role = initializeParams->role;
  ret = BSO_Init(NULL);
  if (ret)
    {
      BLE_PRT("BSO_Init failed\n");
      return ret;
    }
  ret = bleGetBondInfo();
  if (ret)
    {
      BLE_PRT("bleGetBondInfo: NG %d\n", ret);
      return ret;
    }
  switch (role)
    {
      case BLE_ROLE_PERIPHERAL:
      case BLE_ROLE_CENTRAL:
      case BLE_ROLE_PERIPHERAL_AND_CENTRAL:
        ret = blePowerOn();
        if (ret)
          {
            goto errPower;
          }
        ret = bleStackInit();
        if (ret)
          {
            BLE_PRT("bleStackInit: NG %d\n", ret);
            goto errInit;
          }
        else
          {
            commMem.stackInited = true;
          }
          break;
      default:
        ret = -EINVAL;
        break;
    }
  return ret;
errInit:
  bleStackFin();
  blePowerOff();
errPower:
  return ret;

}

int BLE_CommonSetBleEvtCallback(BLE_EfCb funcCb, BLE_EvtCtx *ctx)
{
  if (ctx == NULL)
    {
      return -EINVAL;
    }
  if (commMem.managerCbFlag)
    {
      return -EPERM;
    }

  commMem.cbId = funcCb;
  commMem.bleEvtCtx = ctx;
  commMem.callbackFlag = 1;
  BLE_PRT("%s:commMem.callbackFlag=%d\n", __func__, commMem.callbackFlag);
  return BLE_SUCCESS;
}

int BLE_CommonFinalizeStack(void)
{
  int ret = BLE_SUCCESS;
  if (!commMem.stackInited)
    {
      return ret;
    }
  commMem.callbackFlag = 0;
  commMem.gapMem = NULL;
  if (bleStackFin())
    {
      ret = -EPERM;
    }
  if (blePowerOff())
    {
      ret = -EPERM;
    }
  commMem.stackInited = false;
  return ret;
}

static
int blePowerOn(void)
{
  int ret = 0;
  ret = board_power_control(POWER_BTBLE, true);
  if (ret)
    {
      BLE_PRT("board_power_control(on): NG %d\n", ret);
      goto errPower;
    }
//  for support reset pin. (Will be valid later)
//  board_nrf52_reset(false);
  BLE_PRT("Power on BLE!!\n");
  return BLE_SUCCESS;
errPower:
  (void)board_power_control(POWER_BTBLE, false);
  return ret;

