sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
}

int bleConvertErrorCode(uint32_t errCode)
{
  int ret = 0;
  switch (errCode)
    {
      case NRF_SUCCESS:
        ret = BLE_SUCCESS;
        break;
      case NRF_ERROR_INVALID_PARAM:
        BLE_ERR("errno: 0x%lx, Invalid parameter.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_INVALID_STATE:
        BLE_ERR("errno: 0x%lx, Invalid state.\n", errCode);
        ret = -EPERM;
        break;
      case NRF_ERROR_INVALID_ADDR:
        BLE_ERR("errno: 0x%lx, Bad Memory Address.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_INVALID_FLAGS:
        BLE_ERR("errno: 0x%lx, Invalid flags.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_INVALID_DATA:
        BLE_ERR("errno: 0x%lx, Invalid data.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_DATA_SIZE:
        BLE_ERR("errno: 0x%lx, Data size exceeds limit.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_INVALID_LENGTH:
        BLE_ERR("errno: 0x%lx, Invalid length.\n", errCode);
        ret = -EINVAL;
        break;
      case NRF_ERROR_NOT_SUPPORTED:
        BLE_ERR("errno: 0x%lx, Not supported.\n", errCode);
        ret = -ENOTSUP;
        break;
      case NRF_ERROR_BUSY:
        BLE_ERR("errno: 0x%lx, Busy.\n", errCode);
        ret = -EBUSY;
        break;
      case NRF_ERROR_NO_MEM:
        BLE_ERR("errno: 0x%lx, No Memory for operation.\n", errCode);
        ret = -ENOMEM;
        break;
      case NRF_ERROR_FORBIDDEN:
        BLE_ERR("errno: 0x%lx, Forbidden Operation.\n", errCode);
        ret = -EPERM;
        break;
      case BLE_ERROR_INVALID_CONN_HANDLE:
        BLE_ERR("errno: 0x%lx, Invalid connection handler.\n", errCode);
        ret = -EPERM;
        break;
      case BLE_ERROR_GAP_UUID_LIST_MISMATCH:
        BLE_ERR("errno: 0x%lx, BLE_ERROR_GAP_UUID_LIST_MISMATCH.\n", errCode);
        ret = -EINVAL;
        break;
      case BLE_ERROR_GAP_INVALID_BLE_ADDR:
        BLE_ERR("errno: 0x%lx, BLE_ERROR_GAP_INVALID_BLE_ADDR.\n", errCode);
        ret = -EPERM;
        break;
      case BLE_ERROR_GAP_WHITELIST_IN_USE:
        BLE_ERR("errno: 0x%lx, BLE_ERROR_GAP_WHITELIST_IN_USE.\n", errCode);
        ret = -EPERM;
        break;
      case BLE_ERROR_GAP_DISCOVERABLE_WITH_WHITELIST:
        BLE_ERR("errno: 0x%lx, BLE_ERROR_GAP_DISCOVERABLE_WITH_WHITELIST.\n", errCode);
        ret = -EPERM;
        break;
      case NRF_ERROR_TIMEOUT:
        BLE_ERR("errno: 0x%lx, NRF_ERROR_TIMEOUT.\n", errCode);
        ret = -ETIMEDOUT;
        break;
      default:
        if (errCode > 0)
          {
            BLE_ERR("errno: 0x%lx, Stack error.\n", errCode);
            ret = -EPERM;
          }
        break;
    }
  return ret;
}

static
int bleStackInit(void)
{
  int ret;
  BLE_PRT("nrf_sdh_enable_request\n");
  ret = nrf_sdh_enable_request();
  if (ret)
    {
      return bleConvertErrorCode(ret);
    }
  // Configure the BLE stack using the default settings.
  // Fetch the start address of the application RAM.
  BLE_PRT("nrf_sdh_ble_default_cfg_set\n");
  ret = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, NULL);
  if (ret)
    {
      goto err;
    }
  // Enable BLE stack.
  BLE_PRT("nrf_sdh_ble_enable\n");
  ret = nrf_sdh_ble_enable(NULL);
  if (ret)
    {
      goto err;
    }
  // Register a handler for BLE events.
#ifdef BLE_USE_SECTION
  BLE_PRT("NRF_SDH_BLE_OBSERVER\n");
  NRF_SDH_BLE_OBSERVER(m_ble_observer, 0, (void *)bleEvtDispatch, NULL);
#endif
  return ret;
err:
  nrf_sdh_disable_request();
  return bleConvertErrorCode(ret);
}

static
int bleStackFin(void)
{
  int ret = 0;
  ret = nrf_sdh_disable_request();
  return bleConvertErrorCode(ret);
}

void bleNrfEvtHandler(BLE_Evt *bleEvent, ble_evt_t *pBleNrfEvt)
{
  BLE_PRT("bleNrfEvtHandler 0x%x\n", pBleNrfEvt->header.evt_id);
  memset(bleEvent, 0x00, sizeof(BLE_Evt));
  switch(pBleNrfEvt->header.evt_id)
    {
      case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE:
      case BLE_GATTS_EVT_HVN_TX_COMPLETE:
        onTxComplete(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_CONNECTED:
        onConnect(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_CONN_PARAM_UPDATE:
        onConnParamUpdate(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        onConnParamUpdateRequest(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_DISCONNECTED:
        onDisconnect(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        onSecParamsRequest(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_AUTH_STATUS:
        onAuthStatus(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_PASSKEY_DISPLAY:
        onDispPasskey(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_ADV_REPORT:
        onAdvReport(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_AUTH_KEY_REQUEST:
        onAuthKeyRequest(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_SEC_INFO_REQUEST:
        onSecInfoRequest(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_RSSI_CHANGED:
        onRssiChanged(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTS_EVT_WRITE:
        onGattsWrite(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTS_EVT_HVC:
        onGattsIndConfirm(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_CONN_SEC_UPDATE:
        onConnSecUpdate(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_TIMEOUT:
        onTimeout(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
        onDataLengthUpdateRequest(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
        onDataLengthUpdate(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_SCAN_REQ_REPORT:
        onScanReqReport(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        onPhyUpdateReq(bleEvent, pBleNrfEvt);
        break;
      case BLE_GAP_EVT_PHY_UPDATE:
        onPhyUpdate(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
        onPrimarySrvDiscoveryRsp(&commMem.gattcDb, bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_CHAR_DISC_RSP:
        onCharacteristicDiscoveryRsp(&commMem.gattcDb, bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_DESC_DISC_RSP:
        onDescriptorDiscoveryRsp(&commMem.gattcDb, bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_READ_RSP:
        onReadRsp(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_WRITE_RSP:
        onWriteRsp(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTC_EVT_HVX:
        onHvx(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        onSysAttrMissing(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTS_EVT_TIMEOUT:
        onGattsTimeout(bleEvent, pBleNrfEvt);
        break;
      case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
        onExchangeMtuRequest(bleEvent, pBleNrfEvt);
        break;
    #if NRF_SD_BLE_API_VERSION > 5
      case BLE_GAP_EVT_ADV_SET_TERMINATED:
        onAdvSetTerminate(bleEvent, pBleNrfEvt);
        break;
    #endif
      default:
        bleEvent->evtHeader = (BLE_EventTypes)pBleNrfEvt->header.evt_id;
        BLE_ERR("Unknown event 0x%x\n", bleEvent->evtHeader);
        break;
      }
}

static void ble_advertise(int mode)
{
  int ret = 0;

  if (mode == 2)
    {
      LOG_OUT("ble_peripheral: Long range\n");
      BLE_GapAdvParams p = {0x40, 0, BLE_GAP_PHY_CODED, 0};
      ret = BLE_GapStartAdvExt(&p);

      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("ble enable advertise failed, ret=%d\n", ret);
        }
    }
  else if (mode == 1)
    {
      ret = BLE_GapStartAdv();

      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("ble enable advertise failed, ret=%d\n", ret);
        }
    }
  else
    {
      ret = BLE_GapStopAdv();

      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("ble disable advertise failed, ret=%d\n", ret);
        }
    }
}

