sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
static void on_connected(const BLE_EvtConnected* evt)
{
  int ret = 0;
  LOG_OUT("Connected: handle %d, role %d\n", evt->handle, evt->role);
  g_ble_context.ble_srv_sds.conn_handle = evt->handle;
  g_ble_context.ble_conn_handle         = evt->handle;
  g_ble_context.ble_role                = evt->role;

  struct ble_event_conn_stat_t conn_stat_evt;
  conn_stat_evt.connected = true;
  conn_stat_evt.handle = evt->handle;
  conn_stat_evt.group_id = BLE_GROUP_COMMON;
  conn_stat_evt.event_id = BLE_COMMON_EVENT_CONN_STAT_CHANGE;

  ble_common_event_handler((struct bt_event_t *) &conn_stat_evt);

  if (evt->role != BLE_ROLE_CENTRAL)
    {
      return;
    }

  /* TODO BLE device needs to configure the MTU after connection,
   * wait for the finish of configuring.
   */

  usleep(500 * 1000);

  ret = BLE_GattcStartDbDiscovery(g_ble_context.ble_conn_handle);
  if (BLE_SUCCESS == ret)
    {
      LOG_OUT("[BLE][SUCCESS]BLE_GattcStartDbDiscovery\n");
    }
  else
    {
      LOG_OUT("[BLE][ERROR]BLE_GattcStartDbDiscovery\n");
      LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
    }
}

static void on_disconnected(const BLE_EvtDisconnected* evt)
{
  LOG_OUT("Disconnected: HCI status 0x%x\n", evt->reason);
  g_ble_context.ble_conn_handle = CONN_HANDLE_INVALED;
  struct ble_event_conn_stat_t conn_stat_evt;

  conn_stat_evt.connected = false;

  conn_stat_evt.group_id = BLE_GROUP_COMMON;
  conn_stat_evt.event_id = BLE_COMMON_EVENT_CONN_STAT_CHANGE;

  ble_common_event_handler((struct bt_event_t *) &conn_stat_evt);
  if (g_ble_context.ble_role == BLE_ROLE_PERIPHERAL)
    {
      int ret;
      g_ble_context.ble_srv_sds.notify_enabled = 0;
      LOG_OUT("Advertising restart !!\n");
      ret = BLE_GapStartAdv();
      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("BLE_GapStartAdv failed, ret=%d\n", ret);
        }
    }
}

static uint8_t wait_on_read_rsp_flag = 0;

static void on_db_discovery(BLE_EvtGattcDbDiscovery *db_discovery)
{
  if (db_discovery->result != BLE_GATTC_RESULT_SUCCESS)
    {
      LOG_OUT("[BLE][ERROR]DB Discovery Failed\n");
    }
  else
    {
      LOG_OUT("[BLE][SUCCESS]DB Discovery Success.service count= %d\n",
          db_discovery->params.dbDiscovery.srvCount);
      memcpy(&gattc_db_discovery, &db_discovery->params.dbDiscovery,
          sizeof(BLE_GattcDbDiscovery));
    }
}

static void on_read_rsp(BLE_EvtGattcRead *readRsp)
{
  LOG_OUT("read peer device name:%s\n", readRsp->charValData);
  wait_on_read_rsp_flag = 0;
}

static void on_exchange_feature(const BLE_EvtExchangeFeature* exchange_feature)
{
  BLE_GapPairingFeature* pf = &g_ble_context.pairing_feature;
  int ret = BLE_GapExchangePairingFeature(exchange_feature->handle, pf);

  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("exchange pairing feature failed, ret=%d\n", ret);
    }
  else
    {
      LOG_OUT("exchange pairing feature success\n");
    }
}

static void on_rssi_changed(const BLE_EvtRssiChanged* evt)
{
  LOG_OUT("[BLE][LOG]RSSI changed, value: %d\n", evt->rssi);
}

static void on_disp_passkey(BLE_EvtDisplayPasskey* disp_passkey)
{
  LOG_OUT("[BLE][LOG]Passkey: %s\n", disp_passkey->passkey);
}

static void on_auth_status(BLE_EvtAuthStatus* auth_status)
{
  int ret   = BLE_SUCCESS;
  int index = 0;
  BLE_GapBondInfoList bond_id = {0};
  if (auth_status->status != BLE_GAP_SM_STATUS_SUCCESS)
    {
      LOG_OUT("[BLE][LOG]Pairing failed! ErrCode: %x\n", auth_status->status);
      return;
    }
  else
    {
      LOG_OUT("[BLE][LOG]Pairing success!\n");
    }
  LOG_OUT("[BLE][LOG]save bond address:%02X:%02X:%02X:%02X:%02X:%02X\n",\
      auth_status->bondInfo.addr[5],\
      auth_status->bondInfo.addr[4],\
      auth_status->bondInfo.addr[3],\
      auth_status->bondInfo.addr[2],\
      auth_status->bondInfo.addr[1],\
      auth_status->bondInfo.addr[0]);
  ret = BLE_GapSaveBondInfo(&auth_status->bondInfo);
  if (BLE_SUCCESS == ret)
    {
      LOG_OUT("[BLE][SUCCESS]BLE_GapSaveBondInfo\n");
    }
  else
    {
      LOG_OUT("[BLE][ERROR]BLE_GapSaveBondInfo\n");
      LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
    }

  ret = BLE_GapGetBondInfoIdList(&bond_id);
  if (BLE_SUCCESS == ret)
    {
      LOG_OUT("[BLE][SUCCESS]BLE_GapGetBondInfoIdList\n");
    }
  else
    {
      LOG_OUT("[BLE][ERROR]BLE_GapGetBondInfoIdList\n");
      LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
    }

  LOG_OUT("[BLE][LOG]bond_id.bondNum = %ld\n", bond_id.bondNum);

  for(index=0; index<bond_id.bondNum; index++)
    {
      LOG_OUT("[BLE][LOG]Address[%d]:%02X:%02X:%02X:%02X:%02X:%02X\n",\
          index,\
          bond_id.bondInfoId[index][5],\
          bond_id.bondInfoId[index][4],\
          bond_id.bondInfoId[index][3],\
          bond_id.bondInfoId[index][2],\
          bond_id.bondInfoId[index][1],\
          bond_id.bondInfoId[index][0]);
    }
}

static void on_timeout(BLE_EvtTimeout *timeout)
{
  int ret = BLE_SUCCESS;
  switch(timeout->timeoutSrc)
    {
      case BLE_GAP_TIMEOUT_ADVERTISING:
        LOG_OUT("[BLE][LOG]Timeout reason: Advertising timeout!\n");
        LOG_OUT("[BLE][LOG]Start advertise\n");
        ble_advertise(1);
        break;
      case BLE_GAP_TIMEOUT_SECURITY_REQUEST:
        LOG_OUT("[BLE][LOG]Timeout reason: Security request timeout!\n");
        break;
      case BLE_GAP_TIMEOUT_SCAN:
        LOG_OUT("[BLE][LOG]Timeout reason: Scanning timeout!\n");
        ret = BLE_GapStartScan();
        if (BLE_SUCCESS == ret)
          {
            LOG_OUT("[BLE][SUCCESS]BLE_GapStartScan\n");
          }
        else
          {
            LOG_OUT("[BLE][ERROR]BLE_GapStartScan\n");
            LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
          }
        break;
      case BLE_GAP_TIMEOUT_CONN:
        LOG_OUT("[BLE][LOG]Timeout reason: Connection timeout!\n");
        break;
      default:
        LOG_OUT("[BLE][LOG]Timeout reason: Error\n");
        break;
    }
}

static int input_passkey(uint8_t *key)
{
  LOG_OUT("Please enter passkey:\n");
  const char* name = "passkey_input";
  int len = 0;

  LOG_OUT("%s> ", name);
  fflush(stdout);
  len = readline((char*)key, AUTH_KEY_SIZE, stdin, stdout);
  if (len < 1)
    {
      LOG_OUT("readpasskey error, ret:%d\n", len);
      return -1;
    }
  key[AUTH_KEY_SIZE] = '\0';
  LOG_OUT("passkey = %s", key);
  return BLE_SUCCESS;
}

static void on_auth_key_request(BLE_EvtAuthKey *auth_key)
{
  int ret = BLE_SUCCESS;
  uint8_t key[AUTH_KEY_SIZE + 1] = {0};
  BLE_GapAuthKey key_data = {0};

