sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
  if (BLE_GAP_AUTH_KEY_TYPE_PASSKEY != auth_key->keyType)
    {
      LOG_OUT("[BLE][LOG]Authentication key type is not BLE_GAP_AUTH_KEY_TYPE_PASSKEY!!!\n");
      LOG_OUT("[BLE][LOG]Key type number = %d\n", auth_key->keyType);
      return;
    }
  ret = input_passkey((uint8_t*)key);
  if (BLE_SUCCESS == ret)
    {
      LOG_OUT("[BLE][SUCCESS]input_passkey\n");
    }
  else
    {
      LOG_OUT("[BLE][ERROR]input_passkey\n");
      LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
    }

  key_data.handle  = auth_key->handle;
  key_data.keyType = BLE_GAP_AUTH_KEY_TYPE_PASSKEY;
  key_data.keyLen  = AUTH_KEY_SIZE;
  key_data.key = key;
  ret = BLE_GapReplyAuthKey(&key_data);

  if (BLE_SUCCESS == ret)
    {
      LOG_OUT("[BLE][SUCCESS]BLE_GapReplyAuthKey\n");
    }
  else
    {
      LOG_OUT("[BLE][ERROR]BLE_GapReplyAuthKey\n");
      LOG_OUT("[BLE][ERROR]Error number = %d\n", ret);
    }
}

static void on_conn_params_update(BLE_EvtConnParamUpdate* param)
{
  LOG_OUT("[BLE][LOG]Connection parameters updated\n");
  LOG_OUT("[BLE][LOG]Status: %d\n", param->status);
  LOG_OUT("[BLE][LOG]Minimum interval: %d\n", param->connParams.minConnInterval);
  LOG_OUT("[BLE][LOG]Maximum interval: %d\n", param->connParams.maxConnInterval);
  LOG_OUT("[BLE][LOG]Latency: %d\n", param->connParams.slaveLatency);
  LOG_OUT("[BLE][LOG]Timeout: %d\n", param->connParams.connSupTimeout);
}

typedef struct
{
  uint8_t *data;
  uint16_t data_len;
} data_t;

static int adv_report_parse(uint8_t type, data_t *adv_data, data_t *type_data)
{
  uint16_t index = 0;
  uint8_t *data = adv_data->data;

  while (index < adv_data->data_len)
    {
      uint8_t field_length = data[index];
      uint8_t field_type   = data[index+1];

      if (field_type == type)
        {
          type_data->data   = &data[index+2];
          type_data->data_len = field_length-1;
          type_data->data[type_data->data_len] = '\0';
          return 0;
        }

      index += field_length + 1;
    }

  return -1;
}

static void on_adv_report(BLE_EvtAdvReportData *adv_report)
{
  data_t advReport = {adv_report->data, adv_report->dlen};
  data_t localName;
  uint8_t localNameData[32] = {0};
  localName.data = localNameData;
  localName.data_len = 0;
  int ret;

  if (adv_report_parse(0x09 /* COMPLETE_LOCAL_NAME */, &advReport, &localName) ||
    strncmp((const char *)localName.data, "SONY", strlen("SONY")))
    {
      return;
    }

  LOG_OUT("[BLE][LOG]Peer RSSI:%d Name:%s\n", adv_report->rssi, localName.data);

  ret = BLE_GapStopScan();
  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("BLE_GapStopScan failed, ret=%d\n", ret);
    }

  /* If immediatey disconnect, change slave_latency. */

  ret = BLE_GapConnect(&adv_report->addr);
  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("BLE_GapConnect failed, ret=%d\n", ret);
    }
}

static void on_phy_update_request(BLE_EvtPhyUpdate *phy_update)
{
  LOG_OUT("PHY update request: txPhy 0x%x, rxPhy 0x%x\n",
    phy_update->txPhy, phy_update->rxPhy);

  BLE_GapPhys phy = {phy_update->txPhy, phy_update->rxPhy};
  int ret = BLE_GapPhyUpdate(g_ble_context.ble_conn_handle, &phy);
  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("BLE_GapPhyUpdate failed, ret=%d\n", ret);
    }
}

static void on_phy_update(BLE_EvtPhyUpdate *phy_update)
{
  LOG_OUT("PHY updated: txPhy 0x%x, rxPhy 0x%x\n",
    phy_update->txPhy, phy_update->rxPhy);
}

static void on_data_len_update(BLE_EvtDataLengthUpdate *data_len)
{
  LOG_OUT("Data length updated: maxTx %d, maxRx %d, maxTxTime %d ms, maxRxTime %d ms\n",
    data_len->maxTx, data_len->maxRx, data_len->maxTxTime, data_len->maxRxTime);
}

static
void bleCommEvtDispatch(ble_evt_t *pBleNrfEvt)
{
  BLE_Evt *bleEvent = &commMem.bleEvtCtx->evt;
  bleNrfEvtHandler(bleEvent, pBleNrfEvt);
}

#ifdef BLE_USE_SECTION
static
#endif
void bleEvtDispatch(ble_evt_t *pBleNrfEvt)
{
  BLE_PRT("bleEvtDispatch callbackFlag %d managerCbFlag %d\n",
    commMem.callbackFlag, commMem.managerCbFlag);
  if (commMem.callbackFlag)
    {
      bleCommEvtDispatch(pBleNrfEvt);
    }
  if (commMem.managerCbFlag)
    {
      commMem.managerCb(pBleNrfEvt);
    }
}

#if NRF_SD_BLE_API_VERSION > 5
static
void onAdvSetTerminate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
#ifdef BLE_DBGPRT_ENABLE
  ble_gap_evt_adv_set_terminated_t *set = &pBleNrfEvt->evt.gap_evt.params.adv_set_terminated;
  BLE_PRT("onAdvSetTerminate reason=%d handle=%d num=%d\n",
    set->reason, set->adv_handle, set->num_completed_adv_events);
#endif
  pBleNrfEvt->evt.gap_evt.params.timeout.src = BLE_GAP_TIMEOUT_ADVERTISING;
  onTimeout(pBleEvent, pBleNrfEvt);
}
#endif

static
void onScanReqReport(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  BLE_PRT("onScanReqReort\n");
}

static
void onPhyUpdateReq(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_PHY_UPDATE_REQUEST;
  ble_gap_phys_t *phys = &pBleNrfEvt->evt.gap_evt.params.phy_update_request.peer_preferred_phys;
  BLE_PRT("onPhyUpdateReq tx_phy %d rx_phy %d\n", phys->tx_phys, phys->rx_phys);
  commMem.phyUpdate.txPhy = phys->tx_phys;
  commMem.phyUpdate.rxPhy = phys->rx_phys;
  commMem.phyUpdate.status = 0;
  pBleEvent->evtDataSize = sizeof(BLE_EvtPhyUpdate);
  memcpy(pBleEvent->evtData, &commMem.phyUpdate, pBleEvent->evtDataSize);

  on_phy_update_request((BLE_EvtPhyUpdate *)pBleEvent->evtData);
}

static
void onPhyUpdate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_PHY_UPDATE;
  ble_gap_evt_phy_update_t *phys = &pBleNrfEvt->evt.gap_evt.params.phy_update;
  BLE_PRT("onPhyUpdate stat %d tx_phy %d rx_phy %d\n", phys->status, phys->tx_phy, phys->rx_phy);
  commMem.phyUpdate.txPhy = phys->tx_phy;
  commMem.phyUpdate.rxPhy = phys->rx_phy;
  commMem.phyUpdate.status = phys->status;
  pBleEvent->evtDataSize = sizeof(BLE_EvtPhyUpdate);
  memcpy(pBleEvent->evtData, &commMem.phyUpdate, pBleEvent->evtDataSize);

  on_phy_update((BLE_EvtPhyUpdate *)pBleEvent->evtData);
}

static
void onDataLengthUpdateRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  int ret = 0;
#ifdef BLE_DBGPRT_ENABLE
  ble_gap_data_length_params_t *req = &pBleNrfEvt->evt.gap_evt.params.data_length_update_request.peer_params;
  BLE_PRT("onLenUpReq: max_tx=%d\n", req->max_tx_octets);
  BLE_PRT("onLenUpReq: max_rx=%d\n", req->max_rx_octets);
  BLE_PRT("onLenUpReq: tx_time=%d\n", req->max_tx_time_us);
  BLE_PRT("onLenUpReq: rx_time=%d\n", req->max_rx_time_us);
#endif
  ret = sd_ble_gap_data_length_update(pBleNrfEvt->evt.gap_evt.conn_handle, NULL, NULL);
  if (ret)
    {
      BLE_ERR("onLenUp: sd_ble_gap_data_length_update %d\n", ret);
    }
}

static
void onDataLengthUpdate(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_DATA_LENGTH_UPDATE;
  ble_gap_data_length_params_t *datalen = &pBleNrfEvt->evt.gap_evt.params.data_length_update.effective_params;
  BLE_PRT("onLenUp: max_tx=%d\n", datalen->max_tx_octets);
  BLE_PRT("onLenUp: max_rx=%d\n", datalen->max_rx_octets);
  BLE_PRT("onLenUp: tx_time=%d\n", datalen->max_tx_time_us);
  BLE_PRT("onLenUp: rx_time=%d\n", datalen->max_rx_time_us);
  commMem.dataLen = *(BLE_EvtDataLengthUpdate *)datalen;
  pBleEvent->evtDataSize = sizeof(BLE_EvtDataLengthUpdate);
  memcpy(pBleEvent->evtData, &commMem.dataLen, pBleEvent->evtDataSize);

  on_data_len_update((BLE_EvtDataLengthUpdate *)pBleEvent->evtData);
}

static
void onExchangeMtuRequest(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  int ret = 0;
  ble_gatts_evt_exchange_mtu_request_t *req = &pBleNrfEvt->evt.gatts_evt.params.exchange_mtu_request;
  BLE_PRT("onMtuReq: mtu=%d\n", req->client_rx_mtu);
  if (NRF_SDH_BLE_GATT_MAX_MTU_SIZE > req->client_rx_mtu)
    {
      commMem.client_rx_mtu = req->client_rx_mtu;
    }
  else
    {
      commMem.client_rx_mtu = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
    }
  ret = sd_ble_gatts_exchange_mtu_reply(pBleNrfEvt->evt.gatts_evt.conn_handle, commMem.client_rx_mtu);
  if (ret)
    {
      BLE_ERR("onLenUp: sd_ble_gatts_exchange_mtu_reply %d\n", ret);
    }

  pBleEvent->evtHeader = BLE_GATTS_EVENT_EXCHANGE_MTU;
  commMem.gattsExchangeMTU.connHandle = pBleNrfEvt->evt.gatts_evt.conn_handle;
  commMem.gattsExchangeMTU.client_rx_mtu = req->client_rx_mtu;
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattsExchangeMTU);
  memcpy(pBleEvent->evtData, &commMem.gattsExchangeMTU, pBleEvent->evtDataSize);
}

static
void onTxComplete(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_EVENT_TX_COMPLETE;
  if (pBleNrfEvt->header.evt_id == BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE)
    {
      commMem.txCompleteData.connHandle = pBleNrfEvt->evt.gattc_evt.conn_handle;
      commMem.txCompleteData.count = pBleNrfEvt->evt.gattc_evt.params.write_cmd_tx_complete.count;
      commMem.txCompleteData.role = BLE_ROLE_CENTRAL;
    }
  else
    {
      commMem.txCompleteData.connHandle = pBleNrfEvt->evt.gattc_evt.conn_handle;
      commMem.txCompleteData.count = pBleNrfEvt->evt.gattc_evt.params.write_cmd_tx_complete.count;
      commMem.txCompleteData.role = BLE_ROLE_PERIPHERAL;
    }
  pBleEvent->evtDataSize = sizeof(BLE_EvtTxComplete);
  memcpy(pBleEvent->evtData, &commMem.txCompleteData, pBleEvent->evtDataSize);
}

static void onConnect_hal(void)
{
  struct bt_event_conn_stat_t con_stat_evt;

