sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
  on_timeout((BLE_EvtTimeout *)pBleEvent->evtData);
}

static
void onGattsTimeout(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GATTS_EVENT_TIMEOUT;
  commMem.timeoutData.handle = pBleNrfEvt->evt.gatts_evt.conn_handle;
  commMem.timeoutData.timeoutSrc = BLE_GATT_TIMEOUT_PROTOCOL;
  pBleEvent->evtDataSize = sizeof(BLE_EvtTimeout);
  memcpy(pBleEvent->evtData, &commMem.timeoutData, pBleEvent->evtDataSize);
}

static
void onRssiChanged(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GAP_EVENT_RSSI_CHANGED;
  ble_gap_evt_rssi_changed_t *rssiChanged = &pBleNrfEvt->evt.gap_evt.params.rssi_changed;
  commMem.rssiChangeData.handle = pBleNrfEvt->evt.gap_evt.conn_handle;
  commMem.rssiChangeData.rssi = rssiChanged->rssi;
  commMem.gapMem->peerRssi = rssiChanged->rssi;
  pBleEvent->evtDataSize = sizeof(BLE_EvtRssiChanged);
  memcpy(pBleEvent->evtData, &commMem.rssiChangeData, pBleEvent->evtDataSize);

  on_rssi_changed((BLE_EvtRssiChanged*)pBleEvent->evtData);
}

static void mk_notify_req_event(BLE_SrvSds *srv)
{
  struct ble_gatt_event_notify_req_t notify;

  notify.group_id    = BLE_GROUP_GATT;
  notify.event_id    = BLE_GATT_EVENT_NOTIFY_REQ;
  notify.serv_handle = BLE_GATT_INVALID_SERVICE_HANDLE;
  notify.char_handle = srv->char_ri_handle.charHandle;
  notify.enable      = srv->notify_enabled;

  ble_gatt_event_handler((struct bt_event_t *)&notify);
}

static void mk_write_req_event(ble_gatts_evt_write_t *gattsWrite)
{
  struct ble_gatt_event_write_req_t write;

  write.group_id    = BLE_GROUP_GATT;
  write.event_id    = BLE_GATT_EVENT_WRITE_REQ;
  write.serv_handle = BLE_GATT_INVALID_SERVICE_HANDLE;
  write.char_handle = gattsWrite->handle;
  write.length      = gattsWrite->len;
  memcpy(write.data, gattsWrite->data, write.length);

  ble_gatt_event_handler((struct bt_event_t *)&write);
}

static
void onGattsWrite(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  ble_gatts_evt_write_t * gattsWrite = &pBleNrfEvt->evt.gatts_evt.params.write;
  BLE_SrvSds* srv_sds = &g_ble_context.ble_srv_sds;

  BLE_PRT("gattsWrite->data:%.*s\n",gattsWrite->len, gattsWrite->data);
  BLE_PRT("gattsWrite->handle:%x\n",gattsWrite->handle);
  BLE_PRT("srv_sds->char_ri_handle.dprHandle.cccdHandle:%x\n",
          srv_sds->char_ri_handle.dprHandle.cccdHandle);
  BLE_PRT("gattsWrite->data[0] & 0x01:%d\n",gattsWrite->data[0] & 0x01);

  if (gattsWrite->handle == srv_sds->char_ri_handle.dprHandle.cccdHandle)
    {
      /* client characteristic configuration.bit 0: Notification bit 1: Indication.other reserved.
       * see core spec 4.1 Vol3,PartG,3,3,3,3 client characteristic
       * configuration.Table 3.11
       */

      srv_sds->notify_enabled = (bool)gattsWrite->data[0] & 0x01;

      mk_notify_req_event(srv_sds);
    }
  else
    {
      if (BT_MAX_EVENT_DATA_LEN >= gattsWrite->len)
        {
          mk_write_req_event(gattsWrite);
        }
      else
        {
          BLE_PRT("incoming data exceeds buffer length\n");
        }
    }
}

static
void onGattsIndConfirm(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GATTS_EVENT_CFM;
  ble_gatts_evt_hvc_t * gattsConfirm = &pBleNrfEvt->evt.gatts_evt.params.hvc;
  commMem.gattsIndConfirmData.connHandle    = pBleNrfEvt->evt.gatts_evt.conn_handle;
  commMem.gattsIndConfirmData.handle        = gattsConfirm->handle;
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattsIndConfirm);
  memcpy(pBleEvent->evtData, &commMem.gattsIndConfirmData, pBleEvent->evtDataSize);
}

static void onReadRsp(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GATTC_EVENT_READ;
  ble_gattc_evt_t *bleGattcEvt                         = &(pBleNrfEvt->evt.gattc_evt);
  const ble_gattc_evt_read_rsp_t *bleGattcEvtReadRsp   = &(bleGattcEvt->params.read_rsp);
  commMem.gattcReadData.connHandle    = pBleNrfEvt->evt.gattc_evt.conn_handle;
  commMem.gattcReadData.charValHandle = bleGattcEvtReadRsp->handle;
  commMem.gattcReadData.charValLen    = bleGattcEvtReadRsp->len;
  memcpy(commMem.gattcReadData.charValData, bleGattcEvtReadRsp->data, MAX_VAL_DATA_LENGTH);
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattcRead);
  memcpy(pBleEvent->evtData, &commMem.gattcReadData, pBleEvent->evtDataSize);

  on_read_rsp((BLE_EvtGattcRead *)pBleEvent->evtData);
}

static void onWriteRsp(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GATTC_EVENT_WRITE_RSP;
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattcWriteRsp);

  BLE_EvtGattcWriteRsp* wrRsp = (BLE_EvtGattcWriteRsp*)pBleEvent->evtData;
  ble_gattc_evt_t *bleGattcEvt                         = &(pBleNrfEvt->evt.gattc_evt);
  const ble_gattc_evt_read_rsp_t *bleGattcEvtReadRsp   = &(bleGattcEvt->params.read_rsp);

  wrRsp->connHandle    = bleGattcEvt->conn_handle;
  wrRsp->charValHandle = bleGattcEvtReadRsp->handle;
  wrRsp->status        = bleGattcEvt->gatt_status;
}

static
void onHvx(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  pBleEvent->evtHeader = BLE_GATTC_EVENT_NTFIND;
  ble_gattc_evt_t *bleGattcEvt                = &(pBleNrfEvt->evt.gattc_evt);
  const ble_gattc_evt_hvx_t *bleGattcEvtHvx   = &(bleGattcEvt->params.hvx);
  commMem.gattcNtfIndData.connHandle   = pBleNrfEvt->evt.gattc_evt.conn_handle;
  commMem.gattcNtfIndData.attrHandle   = bleGattcEvtHvx->handle;
  commMem.gattcNtfIndData.type         = (BLE_GattNtyIndType)bleGattcEvtHvx->type;
  commMem.gattcNtfIndData.attrValLen   = bleGattcEvtHvx->len;
  memcpy(commMem.gattcNtfIndData.attrValData, bleGattcEvtHvx->data, MAX_VAL_DATA_LENGTH);
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattcNtfInd);
  memcpy(pBleEvent->evtData, &commMem.gattcNtfIndData, pBleEvent->evtDataSize);
}

static
void onSysAttrMissing(BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  int ret = BLE_SUCCESS;
  ret = sd_ble_gatts_sys_attr_set(commMem.connectData.handle, NULL, 0, 0);
  if (ret) {
    pBleEvent->evtHeader = BLE_GATTS_EVENT_SYS_ATTR_MISSING;
  }
}

static
void setDbDiscoveryEvent(BLE_Evt *pBleEvent, uint16_t connHandle, int result, int reason)
{
  commMem.gattcDbDiscoveryData.connHandle = connHandle;
  commMem.gattcDbDiscoveryData.result = result;
  commMem.gattcDbDiscoveryData.params.reason = reason;
  if (result == BLE_GATTC_RESULT_SUCCESS) {
    commMem.gattcDb.dbDiscovery.srvCount = commMem.gattcDb.currSrvInd;
    memcpy(&commMem.gattcDbDiscoveryData.params.dbDiscovery, &commMem.gattcDb.dbDiscovery, sizeof(BLE_GattcDbDiscovery));
  }
  pBleEvent->evtHeader = BLE_GATTC_EVENT_DBDISCOVERY;
  pBleEvent->evtDataSize = sizeof(BLE_EvtGattcDbDiscovery);
  memcpy(pBleEvent->evtData, &commMem.gattcDbDiscoveryData, pBleEvent->evtDataSize);
  commMem.gattcDb.currCharInd = 0;
  commMem.gattcDb.currSrvInd  = 0;

  on_db_discovery((BLE_EvtGattcDbDiscovery *)pBleEvent->evtData);
  return;
}

static
void onPrimarySrvDiscoveryRsp(bleGattcDb *gattcDbDiscovery, BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  uint16_t connHandle = 0;
  ble_gattc_evt_t *bleGattcEvt = NULL;
  BLE_GattcDbDiscSrv                   *srvBeingDiscovered = NULL;

  bleGattcEvt = &(pBleNrfEvt->evt.gattc_evt);
  connHandle  = bleGattcEvt->conn_handle;
  BLE_PRT2("onPrimary start ind %d\n", gattcDbDiscovery->currSrvInd);
  if (bleGattcEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
    {
      if (gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV)
        {
          gattcDbDiscovery->discoveryInProgress = false;
          BLE_ERR("onPrimary MAX_SRV\n");
          setDbDiscoveryEvent(pBleEvent, connHandle, BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_SERVICE);
          return;
        }
      gattcDbDiscovery->dbDiscovery.connHandle = connHandle;
      srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);

      const ble_gattc_evt_prim_srvc_disc_rsp_t *primSrvcDiscRspEvt = &(bleGattcEvt->params.prim_srvc_disc_rsp);
      srvBeingDiscovered->srvUuid.value.baseAlias.uuidAlias = primSrvcDiscRspEvt->services[0].uuid.uuid; //BLE_ENABLE_NORDIC_ORIGINAL
      srvBeingDiscovered->srvUuid.type = (BLE_GATT_UUID_TYPE)primSrvcDiscRspEvt->services[0].uuid.type; //BLE_ENABLE_NORDIC_ORIGINAL
      srvBeingDiscovered->srvHandleRange.startHandle =  primSrvcDiscRspEvt->services[0].handle_range.start_handle;
      srvBeingDiscovered->srvHandleRange.endHandle =  primSrvcDiscRspEvt->services[0].handle_range.end_handle;
      BLE_PRT2("onPrimary cnt %d type %d uuid 0x%04X sHdl %d eHdl %d\n",
        primSrvcDiscRspEvt->count,
        primSrvcDiscRspEvt->services[0].uuid.type,
        primSrvcDiscRspEvt->services[0].uuid.uuid,
        primSrvcDiscRspEvt->services[0].handle_range.start_handle,
        primSrvcDiscRspEvt->services[0].handle_range.end_handle);
      //get current service info finished. characteristic discovery which belongs to this service.
      (void)characteristicsDiscover(pBleEvent, gattcDbDiscovery);
    }
  else if (bleGattcEvt->gatt_status == BLE_GATT_STATUS_ATTERR_ATTRIBUTE_NOT_FOUND)
    {
      //db discovery complete.send success event to application
      gattcDbDiscovery->discoveryInProgress = true;
      setDbDiscoveryEvent(pBleEvent, connHandle, BLE_GATTC_RESULT_SUCCESS, 0);
    }
  else
    {
      //db discovery error.send event to application
      gattcDbDiscovery->discoveryInProgress = false;
      BLE_ERR("onPrimary Status error %d\n", bleGattcEvt->gatt_status);
      setDbDiscoveryEvent(pBleEvent, connHandle, BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_SERVICE);
    }
}

static
void onCharacteristicDiscoveryRsp(bleGattcDb *const gattcDbDiscovery, BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  uint8_t numCharsPrevDisc = 0;
  uint8_t numCharsCurrDisc = 0;
  uint16_t connHandle = 0;
  uint32_t i               = 0;
  uint32_t j               = 0;
  bool   performDescDiscov = false;
  bool raiseDiscovComplete = false;
  ble_gattc_evt_t                 *bleGattcEvt = &(pBleNrfEvt->evt.gattc_evt);
  BLE_GattcDbDiscSrv       *srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
  BLE_GattcChar            *lastKnownChar = NULL;

  connHandle  = bleGattcEvt->conn_handle;
  if (gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV)
    {
      BLE_ERR("onChar ind NG\n");
      gattcDbDiscovery->discoveryInProgress = false;
      setDbDiscoveryEvent(pBleEvent, connHandle, BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_CHARACTERISTIC);
      return;
    }
  if (bleGattcEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
    {
      const ble_gattc_evt_char_disc_rsp_t * charDiscRspEvt;

      charDiscRspEvt = &(bleGattcEvt->params.char_disc_rsp);

