sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
      numCharsPrevDisc = srvBeingDiscovered->charCount;
      numCharsCurrDisc = charDiscRspEvt->count;
      BLE_PRT2("onChar preCnt %d curCnt %d\n", numCharsPrevDisc, numCharsCurrDisc);
      // Check if the total number of discovered characteristics are supported
      if ((numCharsPrevDisc + numCharsCurrDisc) <= BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV)
        {
          // Update the characteristics count.
          srvBeingDiscovered->charCount += numCharsCurrDisc;
        }
      else
        {
          // The number of characteristics discovered at the peer is more than the supported maximum.
          srvBeingDiscovered->charCount = BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV;
        }

      for (i = numCharsPrevDisc, j = 0; i < srvBeingDiscovered->charCount; i++, j++)
        {
          memcpy(&srvBeingDiscovered->characteristics[i].characteristic.charPrope, &charDiscRspEvt->chars[j].char_props, sizeof(BLE_CharPrope));
          srvBeingDiscovered->characteristics[i].characteristic.charDeclhandle = charDiscRspEvt->chars[j].handle_decl;
          srvBeingDiscovered->characteristics[i].characteristic.charValhandle  = charDiscRspEvt->chars[j].handle_value;
          srvBeingDiscovered->characteristics[i].characteristic.charValUuid.type = (BLE_GATT_UUID_TYPE)charDiscRspEvt->chars[j].uuid.type; //BLE_ENABLE_NORDIC_ORIGINAL
          srvBeingDiscovered->characteristics[i].characteristic.charValUuid.value.baseAlias.uuidAlias = charDiscRspEvt->chars[j].uuid.uuid; //BLE_ENABLE_NORDIC_ORIGINAL
          srvBeingDiscovered->characteristics[i].cccdHandle = BLE_GATT_HANDLE_INVALID;

          BLE_PRT2("onChar type %d uuid 0x%04X ValHdl %d DecHdl %d\n",
            charDiscRspEvt->chars[j].uuid.type,
            charDiscRspEvt->chars[j].uuid.uuid,
            charDiscRspEvt->chars[j].handle_value,
            charDiscRspEvt->chars[j].handle_decl);
        }

      lastKnownChar = &(srvBeingDiscovered->characteristics[i - 1].characteristic);

      // If no more characteristic discovery is required, or if the maximum number of supported
      // characteristic per service has been reached, descriptor discovery will be performed.
      if (!isCharDiscoveryReqd(gattcDbDiscovery, lastKnownChar) ||
      (srvBeingDiscovered->charCount == BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV))
        {
          performDescDiscov = true;
        }
      else
        {
          // Update the current characteristic index.
          gattcDbDiscovery->currCharInd = srvBeingDiscovered->charCount;
          // Perform another round of characteristic discovery.
          BLE_PRT2("onChar charDiscover\n");
          (void)characteristicsDiscover(pBleEvent, gattcDbDiscovery);
        }
    }
  else
    {
      // The previous characteristic discovery resulted in no characteristics.
      // descriptor discovery should be performed.
      performDescDiscov = true;
    }

  if (performDescDiscov)
    {
      gattcDbDiscovery->currCharInd = 0;
      BLE_PRT2("onChar charDiscover\n");
      (void)descriptorsDiscover(pBleEvent, gattcDbDiscovery, &raiseDiscovComplete);
      if (raiseDiscovComplete)
        {
          BLE_PRT2("onChar onSrvDiscCompletion\n");
          onSrvDiscCompletion(pBleEvent, gattcDbDiscovery);
        }
    }
}

static
void onDescriptorDiscoveryRsp(bleGattcDb *const gattcDbDiscovery, BLE_Evt *pBleEvent, ble_evt_t *pBleNrfEvt)
{
  uint32_t i = 0;
  uint16_t connHandle = 0;
  bool raiseDiscovComplete = false;
  BLE_GattcDbDiscSrv *srvBeingDiscovered = NULL;
  ble_gattc_evt_t *bleGattcEvt = NULL;
  bleGattcEvt = &(pBleNrfEvt->evt.gattc_evt);
  BLE_PRT2("onDesc srvInd %d charInd %d\n",
    gattcDbDiscovery->currSrvInd, gattcDbDiscovery->currCharInd);
  srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
  const ble_gattc_evt_desc_disc_rsp_t * descDiscRspEvt = &(bleGattcEvt->params.desc_disc_rsp);
  BLE_GattcDbDiscChar * charBeingDiscovered = &(srvBeingDiscovered->characteristics[gattcDbDiscovery->currCharInd]);

  connHandle  = bleGattcEvt->conn_handle;
  if ((gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV) ||
    (gattcDbDiscovery->currCharInd >= BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV))
    {
      BLE_ERR("onDesc ind NG\n");
      gattcDbDiscovery->discoveryInProgress = false;
      setDbDiscoveryEvent(pBleEvent, connHandle, BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_DESCRIPTOR);
      return;
    }
  if (bleGattcEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
    {
      // The descriptor was found at the peer.
      // If the descriptor was a Client Characteristic Configuration Descriptor, then the cccdHandle needs to be populated.
      // Loop through all the descriptors to find the Client Characteristic Configuration Descriptor.
      for (i = 0; i < descDiscRspEvt->count; i++)
        {
          if (descDiscRspEvt->descs[i].uuid.uuid == BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG)
            {
              charBeingDiscovered->cccdHandle = descDiscRspEvt->descs[i].handle;
              BLE_PRT2("onDesc ccc %d\n", descDiscRspEvt->descs[i].handle);
              break;
            }
        }
    }

  if ((gattcDbDiscovery->currCharInd + 1) == srvBeingDiscovered->charCount)
    {
      // No more characteristics and descriptors need to be discovered. Discovery is complete.
      raiseDiscovComplete = true;
    }
  else
    {
      BLE_PRT2("onDesc retry descriptorsDiscover\n");
      // Begin discovery of descriptors for the next characteristic.
      gattcDbDiscovery->currCharInd++;
      (void)descriptorsDiscover(pBleEvent, gattcDbDiscovery, &raiseDiscovComplete);
    }
  if (raiseDiscovComplete)
    {
      BLE_PRT2("onDesc onSrvDiscCompletion\n");
      onSrvDiscCompletion(pBleEvent, gattcDbDiscovery);
    }
}

static
void onSrvDiscCompletion(BLE_Evt *pBleEvent, bleGattcDb *gattcDbDiscovery)
{
  int ret = BLE_SUCCESS;
  uint16_t nextHandleStart = 0;
  BLE_GattcDbDiscSrv       *srvBeingDiscovered = NULL;
  BLE_GattcDbDiscSrv       *srvPrevDiscovered = NULL;

  // Reset the current characteristic index since a new service discovery is about to start.
  gattcDbDiscovery->currCharInd = 0;
  srvPrevDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);

