sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
  gattcDbDiscovery->currSrvInd++;
  if (gattcDbDiscovery->currSrvInd > BLE_DB_DISCOVERY_MAX_SRV)
    {
      BLE_ERR("onCompletion ind NG\n");
      goto err;
    }
  else
    {
      // Initiate discovery of the next service.
      if (gattcDbDiscovery->currSrvInd < BLE_DB_DISCOVERY_MAX_SRV)
        {
          srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
          // Reset the characteristic count in the current service to zero since a new service
          // discovery is about to start.
          srvBeingDiscovered->charCount = 0;
        }
    }
  if (srvPrevDiscovered->srvHandleRange.endHandle != BLE_GATTC_HANDLE_END)
    {
      nextHandleStart = srvPrevDiscovered->srvHandleRange.endHandle + 1;
    }
  else
    {
      nextHandleStart = BLE_GATTC_HANDLE_END;
    }
  BLE_PRT2("onCompletion nextHandle %d\n", nextHandleStart);
  ret = sd_ble_gattc_primary_services_discover(gattcDbDiscovery->dbDiscovery.connHandle, nextHandleStart, NULL);
  if (ret != NRF_SUCCESS)
    {
      BLE_ERR("sd_ble_gattc_primary_sd NG %d\n", ret);
      goto err;
    }
  return;
err:
  gattcDbDiscovery->discoveryInProgress = false;
  setDbDiscoveryEvent(pBleEvent, gattcDbDiscovery->dbDiscovery.connHandle,
    BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_SERVICE);
  return;
}

static
int characteristicsDiscover(BLE_Evt *pBleEvent, bleGattcDb *const gattcDbDiscovery)
{
  int ret = 0;
  uint8_t              prevCharInd = 0;
  BLE_GattcChar        *prevChar = NULL;
  BLE_GattcDbDiscSrv   *srvBeingDiscovered = NULL;
  BLE_GattcHandleRange handleRange = {0};
  BLE_PRT2("charDiscover start srvInd %d charInd %d\n",
    gattcDbDiscovery->currSrvInd, gattcDbDiscovery->currCharInd);
  if (gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV)
    {
      BLE_ERR("charDiscover NG %d\n", NRF_ERROR_FORBIDDEN);
      goto err;
    }
  srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
  if (gattcDbDiscovery->currCharInd != 0)
    {
      // This is not the first characteristic being discovered. Hence the 'start handle' to be
      // used must be computed using the charValhandle of the previous characteristic.

      prevCharInd = gattcDbDiscovery->currCharInd - 1;

      srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
      prevChar = &(srvBeingDiscovered->characteristics[prevCharInd].characteristic);
      handleRange.startHandle = prevChar->charValhandle + 1;
    }
  else
    {
      // This is the first characteristic of this service being discovered.
      handleRange.startHandle = srvBeingDiscovered->srvHandleRange.startHandle;
    }

  handleRange.endHandle = srvBeingDiscovered->srvHandleRange.endHandle;
  BLE_PRT2("charDiscover sHdl %d eHdl %d\n",
    handleRange.startHandle, handleRange.endHandle);
  ret = sd_ble_gattc_characteristics_discover(gattcDbDiscovery->dbDiscovery.connHandle,
    (ble_gattc_handle_range_t *)&handleRange);
  if (ret)
    {
      BLE_ERR("sd_ble_gattc_cdr NG %d\n", ret);
      goto err;
    }
  return 0;
err:
  gattcDbDiscovery->discoveryInProgress = false;
  setDbDiscoveryEvent(pBleEvent, gattcDbDiscovery->dbDiscovery.connHandle,
    BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_CHARACTERISTIC);
  return -1;
}

static
bool isCharDiscoveryReqd(bleGattcDb *const gattcDbDiscovery,
               BLE_GattcChar         *afterChar)
{
  BLE_PRT2("isChar charEndHdl %d srvEndHdl %d\n", afterChar->charValhandle,
    gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd].srvHandleRange.endHandle);
  if (gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV)
    {
      return false;
    }
  if (afterChar->charValhandle <
  gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd].srvHandleRange.endHandle)
    {
      // Handle value of the characteristic being discovered is less than the end handle of
      // the service being discovered. There is a possibility of more characteristics being
      // present. Hence a characteristic discovery is required.
      return true;
    }
  return false;
}

static
bool isDescDiscoveryReqd(bleGattcDb       *gattcDbDiscovery,
                BLE_GattcDbDiscChar  *currChar,
                BLE_GattcDbDiscChar  *nextChar,
                BLE_GattcHandleRange *handleRange)
{
  BLE_PRT2("isDesc charValHdl %d srvEndHdl %d\n",
    currChar->characteristic.charValhandle,
    gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd].srvHandleRange.endHandle);

  if (gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV)
    {
      return false;
    }
  if (nextChar == NULL)
    {
      // Current characteristic is the last characteristic in the service. Check if the value
      // handle of the current characteristic is equal to the service end handle.
      if (currChar->characteristic.charValhandle ==
        gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd].srvHandleRange.endHandle
      )
        {
          // No descriptors can be present for the current characteristic. currChar is the last
          // characteristic with no descriptors.
          return false;
        }

      handleRange->startHandle = currChar->characteristic.charValhandle + 1;

      // Since the current characteristic is the last characteristic in the service, the end
      // handle should be the end handle of the service.
      handleRange->endHandle = gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd].srvHandleRange.endHandle;
      BLE_PRT2("isDesc start %d end %d\n", handleRange->startHandle, handleRange->endHandle);
      return true;
    }

  // nextChar != NULL. Check for existence of descriptors between the current and the next
  // characteristic.
  if ((currChar->characteristic.charValhandle + 1) == nextChar->characteristic.charDeclhandle)
    {
      // No descriptors can exist between the two characteristic.
      return false;
    }

  handleRange->startHandle = currChar->characteristic.charValhandle + 1;
  handleRange->endHandle   = nextChar->characteristic.charDeclhandle - 1;
  BLE_PRT2("isDesc start %d end %d\n", handleRange->startHandle, handleRange->endHandle);
  return true;
}
static
int descriptorsDiscover(BLE_Evt *pBleEvent, bleGattcDb *const gattcDbDiscovery, bool *raiseDiscovComplete)
{
  uint8_t                    i = 0;
  int                        ret = BLE_SUCCESS;
  BLE_GattcHandleRange       handleRange = {0};
  BLE_GattcDbDiscChar        *currCharBeingDiscovered = NULL;
  BLE_GattcDbDiscSrv         *srvBeingDiscovered = NULL;
  BLE_GattcDbDiscChar        *nextChar = NULL;
  bool                       isDiscoveryReqd = false;

  *raiseDiscovComplete = false;
  BLE_PRT2("descDiscover SrvInd %d CharInd %d\n",
    gattcDbDiscovery->currSrvInd, gattcDbDiscovery->currCharInd);
  if ((gattcDbDiscovery->currSrvInd >= BLE_DB_DISCOVERY_MAX_SRV) || (gattcDbDiscovery->currCharInd >= BLE_DB_DISCOVERY_MAX_CHAR_PER_SRV))
    {
      BLE_ERR("descDiscover NG %d\n", NRF_ERROR_FORBIDDEN);
      goto err;
    }

  srvBeingDiscovered = &(gattcDbDiscovery->dbDiscovery.services[gattcDbDiscovery->currSrvInd]);
  currCharBeingDiscovered = &(srvBeingDiscovered->characteristics[gattcDbDiscovery->currCharInd]);

  if ((gattcDbDiscovery->currCharInd + 1) == srvBeingDiscovered->charCount)
    {
      // This is the last characteristic of this service.
      isDiscoveryReqd = isDescDiscoveryReqd(gattcDbDiscovery, currCharBeingDiscovered, NULL, &handleRange);
    }
  else
    {
      for (i = gattcDbDiscovery->currCharInd; i < srvBeingDiscovered->charCount; i++)
        {
          if (i == (srvBeingDiscovered->charCount - 1))
            {
              // The current characteristic is the last characteristic in the service.
              nextChar = NULL;
            }
          else
            {
              nextChar = &(srvBeingDiscovered->characteristics[i + 1]);
            }

