sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
          // Check if it is possible for the current characteristic to have a descriptor.
          if (isDescDiscoveryReqd(gattcDbDiscovery, currCharBeingDiscovered, nextChar, &handleRange))
            {
              isDiscoveryReqd = true;
              break;
            }
          else
            {
              // No descriptors can exist.
              currCharBeingDiscovered = nextChar;
              gattcDbDiscovery->currCharInd++;
            }
        }
    }

  if (!isDiscoveryReqd)
    {
      // No more descriptor discovery required. Discovery is complete.
      *raiseDiscovComplete = true;
      return NRF_SUCCESS;
    }

  BLE_PRT2("descDiscover sHdl %d eHdl %d\n", handleRange.startHandle, handleRange.endHandle);
  ret = sd_ble_gattc_descriptors_discover(gattcDbDiscovery->dbDiscovery.connHandle, (ble_gattc_handle_range_t *)&handleRange);
  if (ret)
    {
      BLE_ERR("sd_ble_gattc_dd NG %d\n", ret);
      goto err;
    }
  return 0;
err:
  gattcDbDiscovery->discoveryInProgress = false;
  setDbDiscoveryEvent(pBleEvent, gattcDbDiscovery->dbDiscovery.connHandle,
    BLE_GATTC_RESULT_FAILED, BLE_GATTC_REASON_DESCRIPTOR);
  return -1;
}

/****************************************************************************
 * For HAL I/F
 ****************************************************************************/

static int32_t set_adv_data(void)
{
#define BLE_TX_POWER_LEVEL  0
  int ret             = 0;
  int8_t tx_power         = BLE_TX_POWER_LEVEL;
  BLE_GapAdvData adv_data = {0};

  adv_data.flags = BLE_GAP_ADV_LE_GENERAL_DISC_MODE | BLE_GAP_ADV_BR_EDR_NOT_SUPPORTED;
  adv_data.txPower = tx_power;
  adv_data.complete32Uuid = 0;
  adv_data.completeLocalName.advData = (uint8_t*) bt_common_context.ble_name;
  adv_data.completeLocalName.advLength =
    strnlen((char*)adv_data.completeLocalName.advData, BUF_LEN_MAX);
  ret = BLE_GapSetAdvData(&adv_data);

  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("set ble adv data failed, ret=%d\n", ret);
    }

  return ret;
}

static int32_t init_pairing_mode(BLE_GAP_IO_CAP io_cap)
{
  BLE_GapPairingFeature* pf = &g_ble_context.pairing_feature;
  int ret                   = 0;
  BLE_GapOOB oob            = BLE_GAP_OOB_AUTH_DATA_NOT_PRESENT;
  BLE_GapAuth auth          = BLE_GAP_AUTH_REQ_NO_MITM_BOND;
  pf->oob                   = oob;
  pf->ioCap                 = io_cap;
  pf->authReq               = auth;
  pf->minKeySize            = BLE_GAP_MIN_KEY_SIZE;
  pf->maxKeySize            = BLE_GAP_MAX_KEY_SIZE;

  return ret;
}

 
static int ble_start(void)
{
  BLE_InitializeParams params       = {0};
  int ret                       = 0;

  ret = sem_init(&g_ble_context.ble_srv_sds.char_rw_buf_sem, 0, 1);
  if (ret)
    {
      LOG_OUT("service in semaphore init failed.\n");
      return ret;
    }

  params.role = BLE_ROLE_PERIPHERAL;

  ret = BLE_CommonInitializeStack(&params);

  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("ble stack init failed, ret=%d\n", ret);
    }

  return ((BLE_SUCCESS == ret) ? 0 : -1);
}

static int ble_stop(void)
{
  int ret = BLE_CommonFinalizeStack();
  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("ble stack fina failed, ret=%d\n", ret);
    }

  ret = sem_destroy(&g_ble_context.ble_srv_sds.char_rw_buf_sem);
  if (ret)
    {
      LOG_OUT("service in semaphore init failed.\n");
    }
  return ret;
}


/****************************************************************************
 * Name: nrf52_ble_scan
 *
 * Description:
 *   Bluetooth LE start/stop scan.
 *   Start/Stop scan.
 *
 ****************************************************************************/

static int nrf52_ble_scan(bool enable)
{
  int ret = BT_SUCCESS;
  if( true == enable)
    {
      ret = BLE_GapStartScan();
    }
  else
    {
      ret = BLE_GapStopScan();
    }

  return ret;
}

/****************************************************************************
 * Name: nrf52_ble_connect
 *
 * Description:
 *   Bluetooth LE connect to target device
 *
 ****************************************************************************/

static int nrf52_ble_connect(const BT_ADDR *addr)
{
  int ret = BT_SUCCESS;
  BLE_GapAddr gap_addr = {0};

  memcpy(gap_addr.addr, addr->address, sizeof(gap_addr.addr));

  ret = BLE_GapConnect(&gap_addr);

  return ret;
}

/****************************************************************************
 * Name: nrf52_ble_disconnect
 *
 * Description:
 *   Bluetooth LE disconnect link to target device
 *
 ****************************************************************************/

static int nrf52_ble_disconnect(const uint16_t conn_handle)
{
  int ret = BT_SUCCESS;
  BLE_GapConnHandle handle = conn_handle;

  ret = BLE_GapDisconnectLink(handle);

  return ret;
}

static int nrf52_ble_advertise(bool enable)
{
  int ret = 0;
  if (true == enable)
    {
    ret = set_adv_data();
    
      ret = BLE_GapStartAdv();

      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("ble enable advertise failed, ret=%d\n", ret);
        }
    }
  else
    {
      ret = BLE_GapStopAdv();

      if (BLE_SUCCESS != ret)
        {
          LOG_OUT("ble disable advertise failed, ret=%d\n", ret);
        }
    }
  return ret;
}

static int nrf52_ble_set_dev_addr(BT_ADDR *addr)
{
  int ret;
  ble_gap_addr_t nrf52_addr;

  nrf52_addr.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
  memcpy(nrf52_addr.addr, addr->address, sizeof(nrf52_addr.addr));

  ret = sd_ble_gap_addr_set(&nrf52_addr);
  return bleConvertErrorCode(ret);
}

static int nrf52_ble_set_dev_name(char *name)
{
  int ret = BT_SUCCESS;
  size_t nameSize = 0;

  /* Get name length */

  nameSize = strlen(name);

  /* If invalid size, retrun NG */

  if (!name || nameSize > BT_MAX_NAME_LEN)
    {
      return -EINVAL;
    }

  /* Copy device name to local name */

  strncpy(bt_common_context.ble_name, name, nameSize);

  /* Send device name to chip */

  return ret;
}

static int nrf52_ble_set_appearance(BLE_APPEARANCE appearance)
{
  int ret = BT_SUCCESS;
  return ret;
}

static int nrf52_ble_set_ppcp(BLE_CONN_PARAMS ppcp)
{
  int ret = BT_SUCCESS;
  return ret;
}

/****************************************************************************
 * Public Data
 ****************************************************************************/
BLE_Context g_ble_context;

/****************************************************************************
 * BT Dummy
 ****************************************************************************/


/****************************************************************************
 * Name: nrf52_bt_init
 *
 * Description:
 *   Bluetooth Initialize
 *   Prepare NV storage etc for non power item initialize.
 *
 ****************************************************************************/

static int nrf52_bt_init(void)
{
  int ret = BT_SUCCESS;

