sonydevworld/spresense/sdk/modules/bluetooth/hal/nrf52/ble_comm.c
  ret = BLE_CommonSetBleEvtCallback((BLE_EfCb)NULL, &g_ble_context.ble_evt_ctx);

  if (BLE_SUCCESS != ret)
    {
      LOG_OUT("set ble evt callback failed, ret=%d\n", ret);
    }
  init_pairing_mode(BLE_GAP_IO_CAP_NO_INPUT_NO_OUTPUT);
  return (BLE_SUCCESS == ret) ? 0 : -1;
}

/****************************************************************************
 * Name: nrf52_bt_finalize
 *
 * Description:
 *   Bluetooth Finalize
 *   Release NV etc.
 *
 ****************************************************************************/

static int nrf52_bt_finalize(void)
{
  int ret = BT_SUCCESS;

  ret = BSO_Finalize(NULL);
  if (ret)
    {
      ret = -ENXIO;
      BLE_PRT("BSO_Finalize failed\n");
    }

  return ret;
}

/****************************************************************************
 * Name: nrf52_bt_enable
 *
 * Description:
 *   Bluetooth Enable
 *   Turn ON/OFF bluetooth and operate UART and Receive thread.
 *
 ****************************************************************************/

static int nrf52_bt_enable(bool enable)
{
  int ret = BT_SUCCESS;

  if (enable == true)
    {
      ret = ble_start();
    }
  else
    {
      ret = ble_stop();
    }

  return ret;
}

/****************************************************************************
 * Name: nrf52_ble_common_register
 *
 * Description:
 *   Register BLE common HAL I/F
 *
 ****************************************************************************/

int nrf52_ble_common_register(void)
{
  return ble_common_register_hal(&ble_hal_common_ops);
}

/****************************************************************************
 * Name: nrf52_bt_common_register
 *
 * Description:
 *   Register BT common HAL I/F
 *
 ****************************************************************************/

int nrf52_bt_common_register(void)
{
  return bt_common_register_hal(&bt_hal_common_ops);
}

